# include <stdio.h>

// 判断输入的x正整数是否是回文数，如果是，输出“回文”，否则输出“非回文”
void main()
{
	int x, i=0;
	char s[100]="";	// 定义字符数组时养成将其赋初值空字符串的好习惯，定义数值型（int，double，float）数组时养成将其赋初值0的好习惯 int s[10]={0};
	char *p, *q;
	scanf("%d", &x);
	// 先将x中的每一位拆出后存入s[0], s[1]...中，如果判断的是字符串是否是回文，则直接省略该步，跳至下一步。
	while(x)
	{
		s[i++]=x%10;
		x=x/10;
	}
	
	p=s;		// p指向s[0]
	q=s+i-1;	// q指向s[i-1] 最后一个字符

	//依次比较p指向的字符是否等于q指向的字符
	while(p<q)
	{
		// 如果p指向的字符不等于q指向的字符，则肯定不是回文(参见isPrime代码)
		if(*p!=*q)
		{
			break;
		}
		p++;
		q--;
	}
	if(p>=q)
	{
		printf("回文\n");
	}
	else
	{
		printf("非回文\n");
	}
}