# include <stdio.h>

void fun1(float *p)	// 形参也可以写成：(float p[5])  (float p[])  三种写法中的p，类型均相同，表示普通float型指针变量（第2类）
//参数传递：p = s+1 <=> p = &s[1]
{
	p[0] = 100;	// 根据教材P111第4种引用方式可知p[0]<=>s[1]，改变了p[0]的值等价于改变了s[1]的值
	p[1] = 200;	// p[1]<=>s[2]		改变了p[1]的值等价于改变了s[2]的值
}

void fun2(int (*p)[3])	// 形参也可以写成: (int p[2][3]) (int p[][3])  三种写法中的p，类型均相同，表示特殊int型指针变量（第4类）
// 参数传递：p = t 
{
	p[0][0] = 100;	// p[0][0] <=> t[0][0] 改变了p[0][0]的值等价于改变了t[0][0]的值
	p[1][0] = 200;	// p[1][0] <=> t[1][0] 改变了p[1][0]的值等价于改变了t[1][0]的值
}

void fun3(int x)
// 参数传递：x = w[0]  注意这里没涉及到任何指针或者地址的参数传递，x和w[0]均是第1类中的普通int型变量
{
	x = 100;	// 改变了x的值，不会影响w[0]的值
}

void main()
{
	int i, j, t[2][3]={1,2,3,4,5,6},  w[3]={10,20,30};
	float s[5]={4,5,2,6,7};

	fun1(s+1);	// 将s[1]的地址作为实参传递给形参指针
	for(i=0; i<5; i++)
	{
		printf("%g  ", s[i]);	// 输出：4 100  200  6  7
	}
	printf("\n");

	fun2(t);	
	for(i=0; i<2; i++)
	{
		for(j=0; j<3; j++)
		{
			printf("%d, ", t[i][j]);	// 输出：100, 2, 3, 200, 5, 6
		}
	}

	fun3(w[0]);
	printf("%d \n", w[0]);	// 输出：10
}
